package sist.com.operator;

/*
    Operator(연산자),Controller(제어)
    최우선연산자 ( ),[ ],.
    단항연산자  +,-,++,--(전위,후위),!(논리부정)NOT,~(BITNOT) 1001--0101
    산술연산자 +,-,  (*,/,%)
    쉬프트연산자 >>,<<
    관계,비교연산자  >,<,>=,<=, ==,!=
    논리연산자 AND OR XOR
    
    X     Y    Z=X*Y (AND) ,K=X+Y (OR) ,U=XY+XY
    0     0    0                    0
    0     1    0                    1 
    1     0    0                    1  
    1     1    1                    1 
    
    
    논리연산자  (비트) &, ^,| 
                     (일반) &&, || 
    삼항연산자  조건식 ?명령1:명령2
    대입연산자  = *=,-=,+= ,/=,%=,
    콤마 , (순서)
 */

public class Note2 {

}
